{
    "contents":
    [
        {
            "index": "abi-dalzims-horrid-wilting",
            "name": "Abi-Dalzim's Horrid Wilting",
            "desc": [
                "You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren’t affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one.",
                "Nonmagical plants in the area that aren’t creatures, such as trees and shrubs, wither and die instantly."
            ],
            "range": "150 feet",
            "components": ["V", "S", "M"],
            "material": "A bit of sponge",
            "ritual": "false",
            "duration": "Instantaneous",
            "concentration": "false",
            "casting_time": "1 action",
            "damage": {
                "damage_type": {
                    "name": "Necrotic"
                },
                "damage_at_slot_level": {
                    "8": "12d8"
                }
            },
            "dc": {
                "dc_type": {
                    "name": "CON"
                },
                "dc_success": "half"
            },
            "area_of_effect": {
                "type": "cube",
                "size": 30
            },
            "level": 8,
            "school": {
                "name": "Necromancy"
            },
            "classes": [
                {
                    "name": "Sorcerer"
                },
                {
                    "name": "Wizard"
                }
            ]
        },
        {
            "index": "armor-of-agathys",
            "name": "Armor of Agathys",
            "desc": [
                "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear.",
                "You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.",
                "When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot."
            ],
            "range": "Self",
            "components": ["V", "S", "M"],
            "material": "A cup of water",
            "ritual": "false",
            "duration": "1 hour",
            "concentration": "false",
            "casting_time": "1 action",
            "level": 1,
            "school": {
                "name": "Abjuration"
            },
            "classes": [
                {
                    "name": "Warlock"
                }
            ]
        },
        {
            "index": "hex",
            "name": "Hex",
            "desc": [
                "You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability.",
                "If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.",
                "A Remove Curse cast on the target ends this spell early."
            ],
            "higher_level": [
                "When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours."
              ],
            "range": "90 feet",
            "components": ["V", "S", "M"],
            "material": "The petrified eye of a newt",
            "ritual": "false",
            "duration": "1 hour",
            "concentration": "true",
            "casting_time": "1 bonus action",
            "level": 1,
            "school": {
                "name": "Enchantment"
            },
            "classes": [
                {
                    "name": "Warlock"
                }
            ]
        }
    ]
}